consolidate docs
